In [2]:
import pandas as pd

In [7]:
names = ['Taylor Swift','Aaron Sorkin','Harry Potter','Ji-Sung Park']
birthday = ['December 13, 1989','June 9, 1961','July 31, 1980','February 25, 1981']
occupation = ['Singer-songwriter','Screenwriter','Wizard','Footballer']

In [12]:
#리스트로 dataframe만든 방법 1
dict1 = {
    'name': pd.Series(names), 
    'birthday': pd.Series(birthday), 
    'occupation': pd.Series(occupation)
}

In [13]:
pd.DataFrame(dict1)

           name           birthday         occupation
0  Taylor Swift  December 13, 1989  Singer-songwriter
1  Aaron Sorkin       June 9, 1961       Screenwriter
2  Harry Potter      July 31, 1980             Wizard
3  Ji-Sung Park  February 25, 1981         Footballer